<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class BlogsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('blogs')->insert([
            "title" => "Մաթեմատիկան ծրագրավորման մեջ",
            "views" => 125,
            "description" => "
                <p>Մաթեմատիկան ծրագրավորման մեջ</p>
                <p>Հավանաբար, ապագա ծրագրավորողների` ուսանողների համար, ուսումնական հաստատություններում ճիշտ չեն ներկայացնում մաթեմատիկան: Հակառակ դեպքում, այնպիսի հարցեր, ինչպիսիք են, ինչու՞ է անհրաժեշտ մաթեմատիկա, ՏՏ ոլորտի որ ոլորտներում է այն օգտագործվում և այլն, ընդհանրապես չեն առաջանա: Թվում է, թե ի՞նչ կապ ունի մաթեմատիկան ծրագրավորման հետ: Եկեք միասին հասկանանք:</p>
                <p>Մենք չենք կարող համեմատել վեբ ծրագրավորումը Machine Learning-ի հետ։ Վեբ ծրագրավորման համար դպրոցում սովորած մաթեմատիկան էլ բավական է, իսկ Machine Learning-ը կարող է պահանջել բարձրագույն մաթեմատիկա։ Այնպես որ կախված մեր ընտրությունից, այս հարցի պատասխանն էլ փոփոխվում է։</p>
                <p>Մաթեմատիկան այնքան պարտադիր չէ, որքան տրամաբանությունը։
Վեբ ծրագրավորող դառնալու համար մեզ հարկավոր չէ մաթեմատիկան այնքան, որքան մաթեմատիկական մտածելակերպը՝ տրամաբանությունը։ Դպրոցում ստացած գիտելիքը բավարար է վեբ ծրագրավորող դառնալու համար։ Այստեղ կարևոր է իմանալ, թե որ կողմից է հարկավոր մոտենալ տվյալ խնդրին։ Երբ հասկանում ես խնդիրն ու գտնում տրամաբանական շղթան, մնում է միայն լուծելը։ Այսպիսով, եթե դուք մտածում եք, որ հումանիտար լինելը խանգարում է ձեր՝ ծրագրավորման աշխարհ մտնելուն, ապա հավատացեք, որ առանց մաթեմատիկայի հնարավոր է՝ կախված ձեր ընտրած ուղղությունից։</p>
            <p>Բարձրագույն մաթեմատիկան պարտադիր է, երբ․․․
Ծրագրավորման շատ ուղղություններ կան, որոնց մեջ պարտադիր է բարձրագույն մաթեմատիկան։ Օրինակ եթե զբաղվելու եք Machine Learning-ով, կամ ստեղծելու եք խաղեր, ապա միանշանակ պետք է այն։</p><br>

                <iframe width='420' height='345' src='https://www.youtube.com/embed/DSDSiN09yAI' allowfullscreen></iframe>

            ",
            "img" => "/img/banner_courses.png",
            "author" => "Student Helper",
            "date" => "Հունվարի 18, 2022",
            "is_active" => true,
        ]);
        DB::table('blogs')->insert([
            "title" => "Անգլերենը ծրագրավորման մեջ",
            "views" => 125,
            "description" => "
                <p>Բացարձակ սկսնակի համար կարևոր է ամբողջական ուսուցողական նյութերի առկայությունը, թե՛ գրքերի, թե՛ վիդեո դասընթացների տեսքով։ Սակավության պատճառով, ստիպված սկսնակներն օգտվում են հաջորդ ամենաընկալելի լեզվից՝ ռուսերենից։ Շատերը սովորում են ծրագրավորում հենց ռուսերեն գրքերով կամ ռուսական տեսադասերով։ Սա էլ իհարկե, ինչ-որ կետում դառնում է խոչընդոտ, որովհետև կրկին ավելի խորը թեմաներով նյութերը հասանելի են հիմնականում անգլերենով։ </p>
                <p>Այսպիսով առանձնացնենք հետևյալ կետերը հասկանալու համար, թե ինչու կարևոև անգլերենի դերը ծրագրավորման աշխարհում։</p>
                <ul class='standard'>
                    <li>Նյութերի հսկայական պաշար</li>
                    <li>Ծրագրավորման լեզուների տերմինները անգլերենի համանուններ են</li>
                    <li>Միջազգային լեզու է, կարելի է աշխատանք գտնել միջազգային շուկայում</li>
                </ul>
                <iframe width='420' height='345' src='https://www.youtube.com/embed/j1TDIAdTLk0' allowfullscreen></iframe>

            ",
            "img" => "/img/banner_courses.png",
            "author" => "Student Helper",
            "date" => "Հունվարի 18, 2022",
            "is_active" => false,
        ]);
        DB::table('blogs')->insert([
            "title" => "Ծրագրավորողի առաջին քայլերը
",
            "views" => 125,
            "description" => "
                <h2>Ինչպես սկսել 1-ին քայլերը</h2>
                <p>Ծրագրավորումը ունի շատ ճյուղեր։ Ամենից առաջ պետք է հասկանալ թե որ ճղույն եք հավանում։ Կա կայքի ստեղծում, application-ի ստեղծում (android և ios), ռոբոտաշինություն, արհեստական բանականություն և այլն։</p>
               <p>Կարող եք ընտրել սովորելու 2 տարբերակ։ 1-ինը զբաղվել ինքուսությամբ, կամ, կան ուս․ կենտրոններ, որտեղ սովորացնում են ծրագիրը, այնտեղ հաճախել դասերի, բայց դա չի նշանակում որ կարող եք տունը չաշխատել։ Պետք է հասկանաք, որ ամեն ինչ արագ չի լինելու։ Ձեզնից հարկավոր է լիքը ժամանակ և համբերություն։ Միջինում 6 ամիս է պահանջվում մարդուն պատրաստ լինելու դիմել Junior-ին համապտասխան աշխատանքին։</p>
               <p>Դժվար քայլերից մեկը՝ դա, գտնել Ձեզ համապատասխան աշխատանքն է։ Կան կայքեր, որտեղով կարող եք ուսումնասիրել թե ինչ ընկերություն ինչ աշխատակցի է փնտրում։ Այդպիսի կայքերից են՝ staff.am-ը, hr.am-ը և այլն:</p>
                <p>Թե ուսման ընթացքում, թե աշխատանքի փնտրումների ժամանակ շատ հաճախակի են լինում ձախողումները։ Interview-ների ժամանակ լինում են հարցեր, որոնց պատասխանը չիմանալով, ձախողում են Interview-ն։ Բայց դա նորմալ է։ Այդ պահին տվյալ անձը իմանում է իր իրական գիտելիքը։ Պետք է գնալ տուն և սկսել փնտրել այն հարցի պատասխանները որոնց սխալ են պատասխանել։</p>

                <p>Առաջին աշխատանքը դա դեռ չի նշանակում որ վերջ, արդեն կարելի է գործից դուրս ժամերին չաշխատել ինքներդ Ձեզ վրա։ Հաճախակի մարդիկ կորցնում են իրենց աշխատանքը քանի որ մնում են նույն մակարդակի վրա, առաջ չեն շարժվում։ Հիշեք մի բան, որ անգամ ՄԵԾ ԸՆԿԵՐՈՒԹՅԱՆ Team Lead պաշտոնի անձը ունի զարգանալու տեղ, քանի որ ծրագրավորումը գնալով զարգանում է։</p>
                <iframe width='420' height='345' src='https://www.youtube.com/embed/RyDckCn28Yc' allowfullscreen></iframe>
            ",
            "img" => "/img/banner_courses.png",
            "author" => "Student Helper",
            "date" => "Հունվարի 18, 2022",
            "is_active" => true,
        ]);
        DB::table('blogs')->insert([
            "title" => "Հարցազրույցի հարցեր",
            "views" => 125,
            "description" => "
                <h2 class='block_title'>Ինչ հարցեր են հնչում հաճախակի հարցազրույցների ժամանակ</h2>
                <ul class='standard'>
                    <li> Որն է var-ի, let-ի և const-ի տարբերությունները։
Առաջին տարբերություններից մեկն այն է, որ var-ը ունի է function-ալ scope, իսկ let-ը և const-ը block-ային են: Բացի այդ let-ով և const-ով հայտարարված փոփոխականները հնարավոր չէ վերահայտարարել։ Շատերը կարծում են որ let-ը և const-ը hoist չեն լինում, բայց դա այդպես չէ: Պարզապես նրանք initialization չեն լինում ի տարբերություն var-ի:</li>
                    <li> Ինչ տարբերություն x++ ի և ++x ի միջև։
x++ ժամանակ սկզբից տալիս է x-ի արժեքը, այնուհետև ավելացնում է 1-ով, իսկ ++x ժամանակ ավելացնում է 1-ով, այնուհետև վերադարձնում է արժեքը։ Այսինք let x=1; y=x++; y-ի արժեքը կլինի 1, իսկ let x=1; y=++x; y-ի արժեքը կլինի 2:</li>
                    <li> '==' և '===' տարբերությունը։
=== դեպքում բացի արժեքներից նաև ստուգում է իրենց տիպերը։</li>
                <li> Const-ով հայտարարված object-ի մեջ կարող ենք արդյոք փոփոխել կամ ավելացնել որևիցէ դաշտ։
                Այո, քանի որ փոխելով կամ ավելացնելով որևիցէ դաշտ, մենք չենք փոխում նրա ռեֆերանսը</li>
                <li>Break-ի և continue-ի դերը։ Որտեղ են իրենց օգտագործում։
Երկուսն էլ օգտագործվում են ցիկլի ժամանակ։ Break-ը կանգնեցնում է ցիկլը, իսկ continue-ն անցնում է հաջորդ քայլին: Սովորաբար մարդիկ ավարտում են իրենց պատասխանը այսքանն ասելով, բայց նաև պետք է ասել, որ break-ը օգտագործվում է նաև Switch-ի ժամանակ։ Case-ի մեջ գրում ենք break, որպեսզի մյուս case-երը այլևս չստուգի։</li>
            <li>Երկուսն էլ Array-ի method-ներ են։ Map-ը, ստանում է callback և վերադարձնում է նոր զանգված, տարերի հետ կատարելով այն գործողությունն ինչ ուղարկել ենք callback-ով։ Filter-ը ստանում է callback և վերադարձնում է նոր զանգված, որի մեջ կան այն տարերը, որոնք բավարարել են այն պայմանին ինչ ուղարկել ենք callback-ով։</li>
            <li>Arrow Function-ի դեպքում կորցնում ենք իր սեփական this-ը</li>
                </ul>
                <iframe width='420' height='345' src='https://www.youtube.com/embed/wnYKH2dO620' allowfullscreen></iframe>

            ",
            "img" => "/img/banner_courses.png",
            "author" => "Student Helper",
            "date" => "Հունվարի 18, 2022",
            "is_active" => true,
        ]);
    }
}
